[
    {
        "id": "53816",
        "title": "BFF Art Hoe Fashion",
        "description": "Welcome to BFF Art Hoe Fashion. Ellie and her friends are weary of trying the same fashion. Today they planned to try something new. Yes! It&rsquo;s Art Hoe fashion!. You join as a fashion expert and give a company to these girls in choosing their perfect outfit. Browse their wardrobe and pick a suitable one. Don&rsquo;t forget to help them with their makeover. Play and have fun!",
        "instructions": "Left Mouse Button Click",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/x8wpgsqn3woibvl2l5q2egezbq98foce\/",
        "category": "Girls",
        "tags": "Barbie, Cute, Dress Up, Fashion, Girls",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/x8wpgsqn3woibvl2l5q2egezbq98foce\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "56813",
        "title": "Steal them",
        "description": "She was left alone and now takes revenge on all men. She has one task, to prevent the wedding and for this it is necessary to kidnap all the grooms and escape from the brides.",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/iihk9cwyybfwmkfjj37rpb5xa6idok59\/",
        "category": "Arcade",
        "tags": "3D, Arcade, Casual, running",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/iihk9cwyybfwmkfjj37rpb5xa6idok59\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "31115",
        "title": "Pregnant Mommy Care - Prep for Twins",
        "description": "Pregnant Mommy Care is a very fun caring game. Lisa is very tired recently. Probably because she is carrying 2 babies and she is about to labor. Let's look after her together! Start the care with a fantastic face spa for her. Clean her face. Apply a face mask to her face. Oh! She has got so many pimples on her face. Let's move these bad pimples. Lisa is so easily hungry during her pregnancy. Feed her some fruits and juices made on your own. She will be so grateful for your kindness. Lisa is too tired to decorate the babies' rooms, come and decorate their rooms with good taste. Want to know what her babies look like? Click the play button to find out in this game!",
        "instructions": "Tap or click ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/abcafedw3nv1dlg33n05uhyg96xf9xl8\/",
        "category": "Girls",
        "tags": "Baby, Family, Fun, Girl, Girls, H5, HTML5, Kid, Kids",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/abcafedw3nv1dlg33n05uhyg96xf9xl8\/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48335",
        "title": "Zombie Vs SpongeBoob",
        "description": "Join SpongeBoob in an exhilarating arcade adventure! In this fast-paced game, help SpongeBoob sprint through the zany Bikini Bottom streets, dodging menacing zombies and overcoming challenging obstacles. Tap and swipe to guide SpongeBoob as he races against the clock, collecting power-ups and boosters along the way. With vibrant visuals, quirky sound effects, and endless excitement, this game is a thrilling test of reflexes and strategy. How far can you lead SpongeBoob in this undead obstacle course?",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/57hgs0lhezmehersy3370k8lmgbj9u7x\/",
        "category": "Racing",
        "tags": "Adventure, Arcade, Fun, Funny, Game, Games, HTML, HTML5, Kid, Obstacle, run, running, Spongebob, Zombie",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/57hgs0lhezmehersy3370k8lmgbj9u7x\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52920",
        "title": "Five Nights at Horror Games",
        "description": "Welcome to Five Nights at Horror Games, a spine-chilling experience for thrill-seekers! Assume the role of a security guard in the eerie Haggy Lee Mansion Hospital, where strange sounds and suspicious creatures lurk. Keep a close eye on Huggy Lee and Granny Grandmother through surveillance cameras, conserving electricity to prevent their sinister advances. Navigate the labyrinthine hospital, feeling the adrenaline rush as you survive five terrifying nights. Website Developer <a href='https:\/\/www.bestcrazygames.com'>https:\/\/www.bestcrazygames.com<\/a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/nngvaejcv5w8qkis77vn842mfer20fm9\/",
        "category": "Action",
        "tags": "1 Player, Action, Android, Horror, HTML5, iPad, iPhone, Mentolatux, Mobile, Unity3D",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/nngvaejcv5w8qkis77vn842mfer20fm9\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52922",
        "title": "Beach volleyball 3D",
        "description": "In beach volleyball, there are only two people in a team and you will control only one player, but the victory of the team depends on him. The game goes up to three goals scored, only three goals, but the opponents are also not amateurs and do not intend to give away the victory just like that.",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/lik4crzxj5a7mzyg90s5x6xf4md3t3pu\/",
        "category": "Sports",
        "tags": "3D, Arcade, HTML5, Mobile",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/lik4crzxj5a7mzyg90s5x6xf4md3t3pu\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52956",
        "title": "Funny Elon Musk Face",
        "description": "Funny Elon Musk Face - Funny face game that everybody can play and enjoy. Use your mouse to make a funny face of Elon Musk. Share with your friends your funny face creations ! Have fun playing this game here brought to you by video-igrice.com!",
        "instructions": "Mouse to play ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/r9onar060ptk5iln31amcp1olaquhvd4\/",
        "category": "Puzzle",
        "tags": "Celebrity, Draw, Fun, Funny, HTML5, Hypercasual, Puzzle",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/r9onar060ptk5iln31amcp1olaquhvd4\/512x384.jpg",
        "width": "640",
        "height": "480"
    },
    {
        "id": "52355",
        "title": "New Year Santa Claus outside the window",
        "description": "Oh no! New Year is coming soon, but you haven&rsquo;t prepared for it yet! Quickly click on the screen and get ready for the New Year, but be careful! After all, Evil Santa Claus is watching you!",
        "instructions": "Click on the screen your goal is to click 600 times in 3 minutes If you click when Santa Claus appears outside the window he will come closer If he is very close he will jump into your window and you will lose You have got only 3 minutes ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/jclwacxti8oe3hv56ou48kyfx15ncv01\/",
        "category": "Hypercasual",
        "tags": "2D, Action, Arcade, Casual, Christmas, free html5 games for your website, games for your website, Horror, HTML, html games for your website, HTML5, html5 games for your site, Hypercasual, Santa",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/jclwacxti8oe3hv56ou48kyfx15ncv01\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52846",
        "title": "Wild West Poker Lite",
        "description": "Welcome to Wild West Poker a casual poker game that transports you back to the rugged and lawless era of the Wild West, with a Manga touch. As you enter the game, youll find a colorful cast of opponents, each with their own distinct personality and playing style. Every opponent presents a unique challenge, keeping you on your toes as you bluff, bet, and outwit your way to victory. The game-play mechanics stay true to traditional classic poker rules. But be warned, the Wild West is a place where fortunes can change in an instant. Keep a sharp eye on your opponents, manage your bankroll wisely!",
        "instructions": "Point and click With mouse touch-pad or the mobile phone screen ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/cdr9dz5m7hzplv3e20xl1sfrlu608w1i\/",
        "category": "Puzzle",
        "tags": "1 Player, Card, Casino, Casual, gambling, Hypercasual, Poker",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/cdr9dz5m7hzplv3e20xl1sfrlu608w1i\/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51137",
        "title": "Siren Head 3 Game",
        "description": "I hope you have fun playing it. In the upcoming 3D horror\/shooter game Siren Head Forest Return, you and a companion will have to use an ax and anything else you can find to defeat a creature with a siren head. path. Villages and woodlands are the most common habitats for Siren Head Forest Return. Travelers, hikers, and even young children might fall prey to Siren Head. Siren Heads strategy for luring unsuspecting victims into the jungle may use the sound of a distressed person.",
        "instructions": "Controls W A S D to walk around Mouse to Look around Left Mouse Button to Fire Right Mouse Button to Aim Mouse Wheel To Change Weapons G for Grenades R to Reload F to Interact Left Shift to Run Left CTRL to Crouch X to Prone C to Change Camera View Space",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/jwkd6mlipe9b4pt6yx160p7r62djopmj\/",
        "category": "Action",
        "tags": "Horror, kiz10, run, Shooter",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/jwkd6mlipe9b4pt6yx160p7r62djopmj\/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "52971",
        "title": "State Wars",
        "description": "State io Wars is an online strategy game that involves directing your forces to expand your territory. The primary objective is to capture both neutral and enemy territories under your dominion.",
        "instructions": "Left-Click drag Send Troops Touchscreen for Mobile Devices",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/ow2v99y6plh0nq6c7zsmrqahfq9avaam\/",
        "category": "Action",
        "tags": "onlinegames io, Strategy",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/ow2v99y6plh0nq6c7zsmrqahfq9avaam\/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "52170",
        "title": "Python Snake Kill Skibidi Toilet Backrooms",
        "description": "as python snake, kill all skibidi toilet at backroom. Fight all skibidi toilet as python snake before you can escape from backrooms! Enjoy our latest physics game technology!",
        "instructions": "WASD arrow keys move Space - head up M - toggle head up",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/loag23k0i3z173m0jpd6vy0l87oi42v6\/",
        "category": "Adventure",
        "tags": "Physics, Simulation, Skibidi, Skibidi Toilet",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/loag23k0i3z173m0jpd6vy0l87oi42v6\/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "53172",
        "title": "Grand Skibidi Town 2",
        "description": "Grand Skibidi Town 2 features sandbox style gameplay with big city to explore and variety of cars to drive, your mission is to shoot given amount of skibidi toilets in order to progress and unlock new weapons.",
        "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump F - Use ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/zznqrcebzngj8zcz6xsutytcgecbrej2\/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, gta, Shoot, Shoot 'Em Up, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/zznqrcebzngj8zcz6xsutytcgecbrej2\/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "53165",
        "title": "Riders Downhill Racing",
        "description": "Riders are ready! Would you like to join them in a great adventure with Riders Downhill Racing? Various game modes like free ride, race, and career are ready in 1 player and 2 player game modes. Different bikes, costumes, ATV bikes, cross bikes, and speed boats are waiting for you during this great adventure. Join any mode and have super fun! Dont forget to collect diamonds in the free ride to unlock more items. Fly through the ramps, do stunts, and experience exciting moments! Let the ride begin!",
        "instructions": "Player 1 Move W A S D or ARROW KEYS 1P Mode Only Jump Q Parachute Z Nitro SHIFT Switch Vehicle TAB Camera C Restart R Player 2 Move ARROW KEYS Jump K Parachute P Nitro M Select ENTER Camera K Restart L",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/pvy2k1jp0znnq1l8uyai88tk2uc6xcf8\/",
        "category": "Racing",
        "tags": "2 Player, 2 Player Games, atv, Bike, Car, fly, Race, Simulation, Simulator, Stunts",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/pvy2k1jp0znnq1l8uyai88tk2uc6xcf8\/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "53425",
        "title": "Nextbot Run Away",
        "description": "Get ready for the craziest race of your life in NextBots: Run Away! This is something completely different from anything you have seen before. In this addictive arcade game, meme pictures known as Nextbots come after you! The player will have to run as long as possible, dodging persistent Nextbots that become more and more strange as they go. Or you can play in sandbox mode. Collect power-ups, use upgrades and show off your reflexes in this crazy meme escape game!",
        "instructions": "WASD - movement Space - jump TAB - mouse visibility Q - sandbox menu",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/9r3qeppg5l8x4vg43jyi3bzuvrwk56db\/",
        "category": "Action",
        "tags": "1 Player, 3D Games, Action, Avoid, endless, Horror",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/9r3qeppg5l8x4vg43jyi3bzuvrwk56db\/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "53524",
        "title": "GTA New York",
        "description": "This amazing 3D game is a free online take on the legendary Grand Theft Auto game. As you play, youll take control of a thief with assignments all throughout New York City. You have complete freedom to run and explore the games open world. Using the arrows to guide you to the control points, you must sprint across the city and complete over ten interactive levels.",
        "instructions": "Controls WASD to moveMouse to move the camera Click Left Shoot Click Right AimF InteractR ReloadESC for menuSPACEBAR JumpCTRL Run",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/zt4qt847w9o5z06a4ayj5kwy2p9eyifi\/",
        "category": "Action",
        "tags": "3D, Car, kiz10, Shooting",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/zt4qt847w9o5z06a4ayj5kwy2p9eyifi\/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "53816",
        "title": "BFF Art Hoe Fashion",
        "description": "Welcome to BFF Art Hoe Fashion. Ellie and her friends are weary of trying the same fashion. Today they planned to try something new. Yes! It&rsquo;s Art Hoe fashion!. You join as a fashion expert and give a company to these girls in choosing their perfect outfit. Browse their wardrobe and pick a suitable one. Don&rsquo;t forget to help them with their makeover. Play and have fun!",
        "instructions": "Left Mouse Button Click",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/x8wpgsqn3woibvl2l5q2egezbq98foce\/",
        "category": "Girls",
        "tags": "Barbie, Cute, Dress Up, Fashion, Girls",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/x8wpgsqn3woibvl2l5q2egezbq98foce\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "53635",
        "title": "Monster of Garage Storage",
        "description": "Enter the chilling realm of Monster Snap Garage Storages, a survival horror experience plunging players into a harrowing abyss of darkness and peril. Navigate through the eerie corridors of a haunted mansion, gathering scattered toys while evading the menacing specter of Meatly&rsquo;s Storage. With Patrick lurking, survival depends on sharp instincts and rapid thinking to flee the premises. Immerse yourself in a distinctive cartoonish ambiance and a gripping narrative, ensuring constant suspense and uncertainty at every turn.",
        "instructions": "mouse or keyboard and mouse",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/y4sq4nrembaa82mlw961my3al5ynpo73\/",
        "category": "Action",
        "tags": "angry, buggy, Mobile, Monster, Skibidi",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/y4sq4nrembaa82mlw961my3al5ynpo73\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "53974",
        "title": "Backrooms Among Us Rolling Giant",
        "description": "Now you must escape from Impostor Among Us and Rolling giant. But beware granny sometimes accidentally appear to haunt you! Grab all phone before time run out and call your friend to help you!",
        "instructions": "WASD - Move Mouse move - camera Space - Grab item Shift - run",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/swrdago6kojfqo8zn7brgrqymo3jqwq2\/",
        "category": "Adventure",
        "tags": "1 Player, Action, Boy, Horror",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/swrdago6kojfqo8zn7brgrqymo3jqwq2\/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "54032",
        "title": "Stickman Mass Multiplier",
        "description": "Stickman Mass Multiplier invites you to lead vast armies of stick figures into epic battles! Strategically multiply your forces, overwhelming enemies with sheer numbers. Navigate through diverse environments, from lush forests to treacherous mountains, as you conquer territories and expand your dominion. With intuitive controls and fast-paced action, this mobile game offers thrilling gameplay for strategy enthusiasts. Dominate the battlefield, unleash chaos, and prove your mastery in Stickman Mass Multiplier! website dev <a href='https:\/\/www.freecrazygames.io\/'>https:\/\/www.freecrazygames.io\/<\/a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/ljqjgj7zs7xx010um4k2nohcm1zise7q\/",
        "category": "Arcade",
        "tags": "Android, Arcade, HTML5, iPad, iPhone, Mobile, Stickman, Unity3D, WebGL",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/ljqjgj7zs7xx010um4k2nohcm1zise7q\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "54022",
        "title": "Backrooms: Skibidi Shooter 2",
        "description": "Backrooms Skibidi Shooter 2 is a first person shooter game where your mission is to find a way out backrooms crowded with hostile skibidi toilets, use big arsenal of weapons to shoot your way through the levels and try to find the exit in order to progress.",
        "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/2sirxintphvkqs2muv9dze4emyydluai\/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, First Person Shooter, Shoot, Shoot 'Em Up, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/2sirxintphvkqs2muv9dze4emyydluai\/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "53730",
        "title": "Doomsday Survival Rpg Shooter",
        "description": "Doomsday Survival Rpg Shooter is a 2D side-scrolling survival RPG shooting game. Zombies occupy the whole city. You need to recruit the last survivors to fight against zombies for a living. As humans, you need weapons, ammo, food, and medicines. Send your teammates to dispatch different buildings, go to complete the tasks in this fallen town. Time is your life, get out of the safe house and find resources!",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/anvhaw8io64p91g1e72bda0nkow82687\/",
        "category": "Shooting",
        "tags": "1 Player, Shooter, Zombie",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/anvhaw8io64p91g1e72bda0nkow82687\/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "54685",
        "title": "Horror Granny Playtime",
        "description": "This is a horror online hide-and-seek game. If you like the thrill of hide and seek, this game is for you. As the searching party, you must find everyone within the time limit. They may turn into objects in the scene to hide and confuse you. The game fails if you dont catch everyone in the allotted time. You can watch the adverts to view the clues if you cant find them. Welcome to the wonderful adventure world of hide and seek, start the game now.",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/gd6bqzul6asrs570yawzly7mqlj7vw2w\/",
        "category": "Boys",
        "tags": "Horror",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/gd6bqzul6asrs570yawzly7mqlj7vw2w\/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "54991",
        "title": "Poppy Escape",
        "description": "Poppy Escape is a horror game where your mission is to escape dark corridors of an ancient underground and avoid scary huggy wuggy monsters, try to find the exit on each level or collect given amount of toys to progress.",
        "instructions": "WASD - Move LMB - Shoot R - Reload Space - Jump ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/o5i8yvtopemby5lmono1egcxba0l2hbb\/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, Adventure, First Person Shooter, Horror, huggy, Shoot, Shoot 'Em Up, Shooter, Shooting, Unity3D",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/o5i8yvtopemby5lmono1egcxba0l2hbb\/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "54979",
        "title": "Grandfather Road Chase: Realistic Shooter",
        "description": "Your goal is to break away from the chase. But bad luck, you have a rather weak car. No problem! But you have plenty of weapons =)! Use a huge arsenal of weapons to stop the chase. AK47, Minigun, Crossbow, Stationary gun, Machine gun, Flamethrower... Shoot car parts, wheels, body parts. Hand out headshots, do combos! Shoot weapons, machine guns, stationary guns. Do everything to stop the chase. The game has a huge selection of weapons, and there will be even more! Do not rush to relax, the enemy is not asleep. And their attacking arsenal is varied. Motorcycles, ATVs, racing cars, drones, jeeps, helicopters... But you can handle it",
        "instructions": "The task of each level is to break away from the pursuit or rather to destroy all the pursuers Control Shoot left mouse button Aim control by moving the mouse Switch weapons 1 2 3 4 Reload - R Push the screen to shoot and fire on mobile devices ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/09v05p7k4n8t2dlxcmke1qe42rayser4\/",
        "category": "Shooting",
        "tags": "1 Player, 3D, Action, Arcade, Car, crash, Defense, First Person Shooter, gta, Helicopter, Hypercasual, Kill, Shooter, Shooting",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/09v05p7k4n8t2dlxcmke1qe42rayser4\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "55625",
        "title": "Counter Craft: Battle Royale",
        "description": "Counter Craft: Battle Royale is a first person shooter game which features blocky zombie shooting and gun searching across vast map. Your mission is to survive and shoot 100 zombies in order to win.",
        "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump F - Use C - Crouch ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/py4pbr4l63jb6l3dtxcjyuhi1uqtxrep\/",
        "category": "Shooting",
        "tags": "3D, 3D Games, Battlegrounds, First Person Shooter, Gun, Minecraft, Shoot, Shoot 'Em Up, Shooter, Shooting, Unity3D, Zombie",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/py4pbr4l63jb6l3dtxcjyuhi1uqtxrep\/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "55275",
        "title": "Airport Security 3d",
        "description": "Airport Security 3D is an airport security check simulation game with 3D cartoon models. Your mission is to arrest criminals with fake IDs and weapons while approving civilians. On the counter, you need to check the passengers name and corresponding ID card. At the security checkpoint, you are required to check their baggage and find the criminals who take weapons. Finally, you can question the criminals.",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/vsgpevum1ik6sadjaxiu5wbr07vcks2b\/",
        "category": "Hypercasual",
        "tags": "airplane, Simulation",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/vsgpevum1ik6sadjaxiu5wbr07vcks2b\/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "55977",
        "title": "Cute Monkey Mart ",
        "description": "an exciting mobile game that takes you on a whimsical journey into a world Monkey Mart is an exciting and captivating mobile game that takes you on a whimsical journey into a world where monkeys run their very own supermarket. Prepare to be immersed in a vibrant and bustling environment where these adorable primates cultivate and sell a wide array of items to their fellow animal customers.",
        "instructions": "As a player you step into the role of a diligent monkey entrepreneur responsible for managing and expanding Monkey Mart Your primary objective is to help the monkeys grow their business ensuring that the supermarket thrives and becomes the go-to desti",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/labp0rn30i2bbbaj0bmd163u9lty6ung\/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, amazing, Animal, Best Games",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/labp0rn30i2bbbaj0bmd163u9lty6ung\/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "55930",
        "title": "Potrick Garage Storage",
        "description": "Enter the chilling world of Potrick Snaps Meatly Storage, a horror game that plunges you into dark, eerie rooms brimming with jump scares and supernatural surprises. Can you survive the night and unveil the secrets of Potricks house? In this gripping mobile puzzle game, step into the shoes of a mechanic navigating a cluttered garage. Your mission: find hidden machines and unlock them with the correct 4-digit code. Use your wits to solve intricate puzzles, revealing new parts and tools to upgrade your gear, making future tasks easier. Whether you&rsquo;re a seasoned puzzle master or a novice, Meatlys Storage World offers challenges for everyone.",
        "instructions": "F flashlight on and off E to interact with objects and machines W A S D to navigate ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/9oo46a87nxtr397y5hww6vjaxu2dpqza\/",
        "category": "Adventure",
        "tags": "3D, Action, Adventure, Escape, Horror",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/9oo46a87nxtr397y5hww6vjaxu2dpqza\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "56061",
        "title": "The Matrix Merge",
        "description": "Step into the dynamic and intriguing world of Matrix Merge, the ultimate puzzle game that challenges your mind with a twist of personality! In this engaging and addictive game, your goal is to merge and match various iconic faces to create mega-characters and achieve high scores. Gameplay Features: Intuitive Controls: Simply swipe to combine faces and create new, larger characters. Easy to learn, but hard to master! Exciting Levels: Explore hundreds of unique levels, each with different challenges and objectives. Can you master them all? Power-Ups and Boosters: Utilize special power-ups like the Personality Blender, Bomb, and Double Points",
        "instructions": "Mouse Touch",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/i99lrifnezfrvjt692cm91mblkkro6na\/",
        "category": "Arcade",
        "tags": "1 Player, 2 Player, 2D, Adventure, Arcade, Baby Games, Ballon, Bounce, drifting",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/i99lrifnezfrvjt692cm91mblkkro6na\/512x384.jpg",
        "width": "400",
        "height": "800"
    },
    {
        "id": "56210",
        "title": "Build A Rich Queen",
        "description": "Make the most accurate choice and become the most beautiful queen! In Build A Rich Queen, you will bring your credit card. When you encounter a POS machine on the road, you can directly swipe the card to buy clothes and other decorations.",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/cfgp0kyeoasxuesdaqln3xd8wc6tt6nb\/",
        "category": "Racing",
        "tags": "Arcade, grow",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/cfgp0kyeoasxuesdaqln3xd8wc6tt6nb\/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "56074",
        "title": "Grab Them All",
        "description": "Grab Them All is your ticket to thrilling fun as you take down robbers by putting them in the trap! Explore diverse traps on each level and get rid of all the robbers. It is suitable for all ages! Get ready for a blast of excitement and endless entertainment! We control the Hand character with drag mechanics in a 3D movement space. We capture enemies in the arena and take them to the machines. Different destructive tools are unlocked in each level. Different level designs provide the player with a minimum 30-minute experience.",
        "instructions": "PC Controls Drag left-click WASD arrow keys move Shift faster movement Left-click space do the action Mobile Controls Drag move Tap do the action",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/ebmpyq4ba3qz9bakjn7ttvzdgqwgfp06\/",
        "category": "Arcade",
        "tags": "Casual, destroy, Platform",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/ebmpyq4ba3qz9bakjn7ttvzdgqwgfp06\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "56313",
        "title": "You have to eat cheese",
        "description": "In this fast-paced, action-packed game, you control a rat as it scurries through a maze, trying to reach a piece of cheese while being chased by a cat. The rat must jump over obstacles and avoid the cat to reach the cheese before time runs out. With its simple controls and addictive gameplay, You have to eat cheese is sure to keep you entertained for hours on end. Features: Fast-paced action: The rat must move quickly to avoid the cat and reach the cheese before time runs out. Simple controls: The game is easy to pick up and play, with intuitive controls that make it accessible to players of all ages.",
        "instructions": "Click to jump the mouse ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/1dor95jxtehxp7coyqrm0bl0k6wlml7a\/",
        "category": "Hypercasual",
        "tags": "1 Player, Animal, Cat, Physics",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/1dor95jxtehxp7coyqrm0bl0k6wlml7a\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "55983",
        "title": "Stunt Maps",
        "description": "Stunt Maps Get ready to defy gravity and push your skills to the limit with Stunt Maps, the ultimate stunt driving experience! Jump into a world of high-octane action, where you&rsquo;ll soar through the skies, navigate impossible loops, and perform jaw-dropping stunts on mind-bending maps. Whether youre racing against time or just showing off your best tricks.",
        "instructions": "Driving W A S D Keys Or Arrow Keys Respawning Hold R Until Respawn Bar Fills To End",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/we3v62yymmy7l2m9yuvuxdewrro4tloo\/",
        "category": "Racing",
        "tags": "Cars, gta, Racing, Stunts",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/we3v62yymmy7l2m9yuvuxdewrro4tloo\/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49774",
        "title": "Fall Guy 2024",
        "description": "An easygoing brainteaser where your objective is to land safely. It seems straightforward but is surprisingly complex. Enjoy the wide range of levels while honing your mental acuity. Web Dev <a href='https:\/\/www.game-plays.com\/'>https:\/\/www.game-plays.com\/<\/a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/v3yu7w2xefhhjb1aqdv7xb41t990o291\/",
        "category": "Hypercasual",
        "tags": "Android, Click, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Unity3D, WebGL",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/v3yu7w2xefhhjb1aqdv7xb41t990o291\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "56559",
        "title": "Bus School Park Driver",
        "description": "Take the wheel in Bus School Park Driver! Master the art of bus driving with precision parking, smooth navigation, and real-world traffic challenges. Whether you&rsquo;re maneuvering through tight school zones or handling complex parking scenarios, every level tests your skills. Perfect your driving techniques, complete engaging missions, and become the ultimate school bus driver. Web Dev <a href='https:\/\/www.coolcrazygames.com\/'>https:\/\/www.coolcrazygames.com\/<\/a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/i429yunzarak64517ysvdeki741nrdoc\/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, bus, Car, Driving, Unity3D, WebGL",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/i429yunzarak64517ysvdeki741nrdoc\/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "56653",
        "title": "KangaHang",
        "description": "Step into the quirky world of KangaHang, where your word-guessing skills are put to the ultimate test! Meet Kanga, the snarky hero at the center of the action. Kanga is full of irony, ready with witty remarks every time you make a mistake. Click\/tap letters to uncover hidden words or phrases across a variety of categories including Olympic sports, Cartoon Characters, Animals, Plants and more. Solve 10 puzzles to rescue Kanga from a sticky situation.",
        "instructions": "Click tap to select letters ",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/7m1q5unty6a6s3stp1xrpgvu8tpr2j1k\/",
        "category": "Puzzle",
        "tags": "Arcade, Guessing, Puzzle, Word",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/7m1q5unty6a6s3stp1xrpgvu8tpr2j1k\/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "19040",
        "title": "Baby Taylor Beach Cleaning Day",
        "description": "Taylor's kindergarten often organizes activities to experience work and life. Taylor and her friends like to participate in these activities. Today they will go to the beach under the leadership of Teacher Doris to volunteer. Although the work on the beach is not difficult, it will be very hard for Taylor and her friends. Would you like to volunteer with Tyler? Come join Taylor's team and work together!",
        "instructions": "Mouse click or tap to play",
        "url": "https://seep.eu.org/https:\/\/html5.gamemonetize.com\/d0pz2bdyxmmq9hxxvl59r9h5gg4gw1g9\/",
        "category": "Girls",
        "tags": "Baby, Cleaning, Cute, Doctor, Dress Up, Educational, Girl, Girls, Kids, Puzzle, Surgery",
        "thumb": "https://seep.eu.org/https:\/\/img.gamemonetize.com\/d0pz2bdyxmmq9hxxvl59r9h5gg4gw1g9\/512x384.jpg",
        "width": "504",
        "height": "800"
    }
]